supplementary_work/pages/ARD_2015.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>ARD 2015</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">ARD 2015</h1>
<div class="github-fork-ribbon-wrapper left">
        <div class="github-fork-ribbon">
            <a href="https://github.com/MarcScott/Supplementary Work">Fork me on GitHub</a>
        </div>
</div>
<div id="stickyribbon">
    <ul>
      <li><a href="ARD_2015.html">ARD 2015</a></li>
    </ul>
</div>

<div id="outline-container-sec-1" class="outline-2 activity">
<h2 id="sec-1"><span class="section-number-2">1</span> ARD Work - 2015</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3 learn">
<h3 id="sec-1-1">Year 7 - Systems &amp; Control</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Using Bourne To Invent - <a href="https://www.bournetoinvent.com/projects/7-SC-Mechanisms/pages/3_Lesson.html">Motors</a> - complete all the badge tasks.
</li>
<li>If you have already completed the Motors lesson, then make sure you have completed the <a href="https://www.bournetoinvent.com/projects/7-SC-Mechanisms/pages/2_Lesson.html">Silver task on Pulleys</a> (note - this page needs viewing in Firefox).
</li>
<li>If you have completed this already, then use online resources to research and write about the use of linear cams in pin and tumbler locks.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3 learn">
<h3 id="sec-1-2">Year 7 - Computing</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>You've been using html and css to build your own web-pages.
</li>
<li>You can also use html and css to create logos and graphics for your web-page, but it's a little tricky to do without some help.
</li>
<li>Go to <a href="http://html-generator.weebly.com/css-shape-generator.html#007BFFy1z-76z-27z17z0">This html generator site</a>
</li>
<li>Use the simple tools to create a graphic for your web-page.
</li>
<li>You can then copy and paste the generated html into a page of your own.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3 learn">
<h3 id="sec-1-3">Year 8 - Computing</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>You have been learning to program text-based games this term.
</li>
<li>In one of the next lessons, you are going to create a text-based adventure game.
</li>
<li>The player of the game will be able to move North, South, East and West, pick up items and fight the bad guys.
</li>
<li>Sketch out a map of the environment for your game. It could be a haunted castle for instance, or the inside of a human body. Use your imagination.
</li>
<li>Label items that can be picked up by the player, and annotate to include where and how those items can be used.
</li>
<li>Label opponents that can be thwarted by the player.
</li>
<li>Your map must include a minimum of 8 different areas.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3 learn">
<h3 id="sec-1-4">Year 9 - Systems &amp; Control</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Later this term you will be experimenting with different mechanisms.
</li>
<li>Electric motors are often used to drive various mechanical mechanisms.
</li>
<li>Use <a href="https://www.bournetoinvent.com/projects/7-SC-Mechanisms/pages/3_Lesson.html">this resource on Bourne To Invent</a> and complete all the badge tasks.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3 learn">
<h3 id="sec-1-5">Year 9 - Additional ICT</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>Colbie Caillat recently took a stand against Photoshop in her new music video, "Try." She and several other women go from all-made-up to completely natural to make their point clear.
</li>
<li>Write minimum of half a page arguing for or against Photoshop in the media, backing your arguments up using factual statements from news items.
</li>
<li>Take a look at the <a href="https://www.youtube.com/watch?v=iYhCn0jf46U">Dove evolution</a> time lapse you tube video, to see how Photoshop is being used.
</li>
<li>Look also at the<a href="https://www.bbc.co.uk/news/business-23714699"> BBC news website</a> for Photoshop items.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-6" class="outline-3 learn">
<h3 id="sec-1-6">Year 10 - Systems &amp; Control</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>Continue to write the first up your proposal for your CA project.
</li>
<li>Project options are located in: G:\Systems and Control\Year 10-11 GCSE S&amp;C\Year 10\.
</li>
<li>Mr. Brown can be emailed with any specific queries.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-7" class="outline-3 learn">
<h3 id="sec-1-7">Year 10 - Computing</h3>
<div class="outline-text-3" id="text-1-7">
<ul class="org-ul">
<li>Continue with your Controlled Assessment write up.
</li>
<li>If you can not access the console for your VM, then you can continue the write-up with any document editing software and use your repo on Github for guidance.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-8" class="outline-3 learn">
<h3 id="sec-1-8">Year 11 - Computing</h3>
<div class="outline-text-3" id="text-1-8">
<ul class="org-ul">
<li>Continue working on your Controlled Assessment write-up
</li>
<li>This is due in on Monday morning.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-9" class="outline-3 learn">
<h3 id="sec-1-9">Year 12 - Systems &amp; Control</h3>
<div class="outline-text-3" id="text-1-9">
<ul class="org-ul">
<li>Continue with your coursework write-up
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-10" class="outline-3 learn">
<h3 id="sec-1-10">Year 12 - Computing</h3>
<div class="outline-text-3" id="text-1-10">
</div>
</div>
<div id="outline-container-sec-1-11" class="outline-3 learn">
<h3 id="sec-1-11">Year 13 - Systems &amp; Control</h3>
<div class="outline-text-3" id="text-1-11">
<ul class="org-ul">
<li>Continue with your coursework write-up
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
